#!/usr/bin/env bash

# === БЛОК 1: ФУНКЦИЯ ПОЛУЧЕНИЯ ЦВЕТА ===
get_color() {
    # ПРИЕМ АРГУМЕНТОВ:
    local color_num=$1      # Какую цифру ввел пользователь (1-6).
    local is_background=$2  # Это фон (1) или шрифт (0)?

    # case — переключатель. Смотрим, чему равен color_num.
    case $color_num in
        1) # Если выбрали 1 (White - Белый)
            # ЛОГИКА: [[ $is_background -eq 1 ]] && echo "47" || echo "97"
            # Если нам нужен фон (is_background равно 1), то выдаем код "47" (белый фон).
            # ИНАЧЕ (||) выдаем код "97" (белый яркий текст).
            [[ $is_background -eq 1 ]] && echo "47" || echo "97"
            ;;
        2) # Если 2 (Red - Красный)
            # Фон "41" (красный) или Текст "31" (красный).
            [[ $is_background -eq 1 ]] && echo "41" || echo "31"
            ;;
        3) # 3 (Green - Зеленый) -> Фон 42 / Текст 32
            [[ $is_background -eq 1 ]] && echo "42" || echo "32"
            ;;
        4) # 4 (Blue - Синий) -> Фон 44 / Текст 34
            [[ $is_background -eq 1 ]] && echo "44" || echo "34"
            ;;
        5) # 5 (Purple - Фиолетовый) -> Фон 45 / Текст 35
            [[ $is_background -eq 1 ]] && echo "45" || echo "35"
            ;;
        6) # 6 (Black - Черный) -> Фон 40 / Текст 30
            [[ $is_background -eq 1 ]] && echo "40" || echo "30"
            ;;
        *) # Если ввели что-то другое (звездочка = "все остальное")
            echo ""
            ;;
    esac
}